# CSB352: Data Mining LAB 

**Instructor** : [Dr. Chandra Prakash]

* For more information visit the [class website](https://cprakash86.wordpress.com/csb352_s21/).

* DATE: 01-Feb-2021

# LAB  5: Data Pre-Processing

### Feature Engineering in ML 

1. Data Visualization

2. Data Pre-processing 
    - Missing Values 
    - Handling Outliers
    - Label Encoding
    - Log Transform
        - handle skewed data and after transformation, the distribution becomes more approximate to normal.
        - decreases the effect of the outliers
    - Binning
        - Binning can be applied on both categorical and numerical data.
        - Model more robust and prevent overfitting
        
    - Scaling/ Normalization
        - Need of Normalization
        - Type of Normalization
            - Min-Max Normalization
            - Standard Normalization / Standardization
            - Z-score Normalization
    - Feature Split / Joining

### Need of Pre-Processing 

![title](preprocessing.png)

# PART 4.1: Tabular data Pre-processing

- Structured data - Tabular data
- Semistructured data - Json data
- Unstructured data - Text file

**Downlaod the DATA**

In [37]:

from datetime import datetime

try:
    from google.colab import drive
    %tensorflow_version 2.x
    COLAB = True
    print("Assignment 4")
    print("Note: using Google CoLab")
except:
    print("Assignment 4")
    print("Note: not using Google CoLab")
    COLAB = False
    
# Print your name and Roll No. 
print('Name :Rohit Byas')
print('Roll No. : 181210043')
# Print the curent time

now = datetime.now()

current_time = now.strftime("%H:%M:%S")
print("Current Time =", current_time)

Assignment 4
Note: using Google CoLab
Name :Rohit Byas
Roll No. : 181210043
Current Time = 08:56:34

## Data reading and setup

In [192]:
import numpy as np
import pandas as pd

In [193]:
# Read the Dataset 

data_actuals=pd.read_csv('data/actuals.csv')
data_schedules=pd.read_csv('data/schedules.csv')
data_drones=pd.read_csv('data/drones.csv')

data_services=pd.read_csv('data/services.csv')
data_stations=pd.read_csv('data/stations.csv')

In [194]:
# Show the top 5 rows of actuals.csv

data_actuals.head()

  actual_arrival_datetime actual_departure_datetime  ...  station    station_call_id
0        2050-07-01 05:06          2050-07-01 06:00  ...    Iwade  JP_0_205007010506
1        2050-07-01 06:19          2050-07-01 07:00  ...   Komono  JP_0_205007010619
2        2050-07-01 07:09          2050-07-01 08:00  ...     Toba  JP_0_205007010709
3        2050-07-01 08:21          2050-07-01 09:00  ...     Gero  JP_0_205007010821
4        2050-07-01 09:09          2050-07-01 10:00  ...      Ina  JP_0_205007010909

[5 rows x 8 columns]

In [195]:
# Show the top 5 rows of schedules.csv
data_schedules.head()

   forecast_windspeed_kts scheduled_arrival_datetime  ... station    station_call_id
0                       4           2050-07-01 05:06  ...   Iwade  JP_0_205007010506
1                       7           2050-07-01 06:19  ...  Komono  JP_0_205007010619
2                       6           2050-07-01 07:09  ...    Toba  JP_0_205007010709
3                       8           2050-07-01 08:21  ...    Gero  JP_0_205007010821
4                      13           2050-07-01 09:09  ...     Ina  JP_0_205007010909

[5 rows x 6 columns]

In [196]:
# Show the top 5 rows of drones.csv

data_drones.head()

   capacity_persons  drone_id  ...  optimal_altitude_ft service_id
0               114   971-LGB  ...                 1000       JP_0
1               438   ZTG 357  ...                 1000       DZ_0
2               493   I55 1AC  ...                 2000       DE_1
3               154  XUW-2971  ...                 1000       US_0
4                59     564AL  ...                 1000       JP_2

[5 rows x 10 columns]

### Merge DATA

In [197]:
# HOW  to Merge df_schedules and df_drones data 
# Check the merge command help 

## WRITE YOUR CODE 
final_data = data_schedules.merge(data_drones,on='service_id')
final_data.head()

   forecast_windspeed_kts  ... optimal_altitude_ft
0                       4  ...                1000
1                       7  ...                1000
2                       6  ...                1000
3                       8  ...                1000
4                      13  ...                1000

[5 rows x 15 columns]

### Drop  a column /Row

In [188]:
# Check the drop command help and write the syntex

In [198]:
clm_to_drop = ['scheduled_arrival_datetime','scheduled_departure_datetime','service_id','station','manufacturer','drone_id']

In [189]:
final_data

       forecast_windspeed_kts  ... optimal_altitude_ft
0                           4  ...                1000
1                           7  ...                1000
2                           6  ...                1000
3                           8  ...                1000
4                          13  ...                1000
...                       ...  ...                 ...
12489                       1  ...                1000
12490                       1  ...                1000
12491                       0  ...                1000
12492                       2  ...                1000
12493                       6  ...                1000

[12494 rows x 15 columns]

In [200]:
final_data.drop(columns=clm_to_drop,inplace=True)
# Those values were dropped and the changes were made in the original data frame since inplace was True.

In [179]:
final_data

       forecast_windspeed_kts  ... optimal_altitude_ft
0                           4  ...                1000
1                           7  ...                1000
2                           6  ...                1000
3                           8  ...                1000
4                          13  ...                1000
...                       ...  ...                 ...
12489                       1  ...                1000
12490                       1  ...                1000
12491                       0  ...                1000
12492                       2  ...                1000
12493                       6  ...                1000

[12494 rows x 9 columns]

### Divide DATA into Training and Testing

In [180]:
traning_data = final_data.merge(data_actuals[['arrival_delay_seconds','station_call_id']],on='station_call_id')

In [181]:
test_data = final_data[~final_data['station_call_id'].isin(traning_data['station_call_id'].to_list())]

In [112]:
# Display the traning_data
traning_data

      forecast_windspeed_kts  ... arrival_delay_seconds
0                          4  ...                     2
1                          7  ...                     5
2                          6  ...                     2
3                          8  ...                     6
4                         13  ...                     3
...                      ...  ...                   ...
9919                       0  ...                   596
9920                       0  ...                   686
9921                       0  ...                   657
9922                       1  ...                   596
9923                       0  ...                   686

[9924 rows x 10 columns]

In [113]:
# Display the test_data

In [114]:
from sklearn.preprocessing import LabelEncoder,StandardScaler

In [ ]:
# Drop station_call_id from traning_data and test_data dataframe

In [115]:
traning_data.drop(columns=['station_call_id'],inplace=True)
test_data.drop(columns=['station_call_id'],inplace=True)

/usr/local/lib/python3.6/dist-packages/pandas/core/frame.py:4174: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [116]:
traning_data.head()

   forecast_windspeed_kts  ...  arrival_delay_seconds
0                       4  ...                      2
1                       7  ...                      5
2                       6  ...                      2
3                       8  ...                      6
4                      13  ...                      3

[5 rows x 9 columns]

In [117]:
test_data.head()

     forecast_windspeed_kts  ...  optimal_altitude_ft
15                       10  ...                 1000
28                        2  ...                 1000
145                      19  ...                 1000
273                      11  ...                 1000
422                      20  ...                 1000

[5 rows x 8 columns]

In [118]:
features = list(traning_data.columns)

In [119]:
features

['forecast_windspeed_kts',
 'capacity_persons',
 'fuel_consumption_gm_per_mile',
 'max_altitude_ft',
 'max_capacity_fuel_gm',
 'min_capacity_fuel_gm',
 'operating_speed_mph',
 'optimal_altitude_ft',
 'arrival_delay_seconds']

remove() is an inbuilt function in Python programming language that removes a given object from the list. It does not return any value.

In [120]:
#remove the arrival_delay_seconds  object from the list 

features.remove('arrival_delay_seconds')

In [121]:
features

['forecast_windspeed_kts',
 'capacity_persons',
 'fuel_consumption_gm_per_mile',
 'max_altitude_ft',
 'max_capacity_fuel_gm',
 'min_capacity_fuel_gm',
 'operating_speed_mph',
 'optimal_altitude_ft']

Training part as train X and Train Y

In [122]:
trainX,trainY = traning_data[features].values,traning_data['arrival_delay_seconds'].values

In [123]:
testX = test_data.values

In [124]:
trainY

array([  2,   5,   2, ..., 657, 596, 686])

In [125]:
trainX.shape,trainY.shape,testX.shape

((9924, 8), (9924,), (2570, 8))

## Normalization

- Need of Normalization 
- Type of Normalization 

- Min-Max Normalization:

z= (x-min)/max-min 


- Standard Normalization :  Z Normalization(Standardization):

z=x-x(mean)/standared  deviation 


- Nean or Normal Mean

In [126]:
StandardScaler?

In [130]:
scaler = StandardScaler()

Z = x-x.mean()/x.std()

In [132]:
scaler.fit(trainX)

StandardScaler(copy=True, with_mean=True, with_std=True)

In [140]:
scaler.transform?

In [141]:
trainX_norm = scaler.transform(trainX)
testX_norm = scaler.transform(testX)

In [142]:
trainX.max(),trainX.min(),trainX.mean()

(28280.0, 0.0, 2008.0340089681579)

In [143]:
trainX_norm.max(),trainX_norm.min(),trainX_norm.mean()

(6.617838095190163, -1.4182271125805397, -1.0023779021202541e-17)

## Label Encoding

#### DATA 
    S.No   Country	Age	 Salary

    0   India   44   72000
    1      US   34   65000
    2   Japan   46   98000
    3      US   35   45000
    4   Japan   23   34000

In [144]:
df=pd.read_csv("data/Salary.csv")

In [145]:
df

  Country  Age  Salary
0   India   44   72000
1      US   34   65000
2   Japan   46   98000
3      US   35   45000
4   Japan   23   34000

In [146]:
df.info

<bound method DataFrame.info of   Country  Age  Salary
0   India   44   72000
1      US   34   65000
2   Japan   46   98000
3      US   35   45000
4   Japan   23   34000>

In [147]:
from sklearn import preprocessing
label_encoder = preprocessing.LabelEncoder()   # labelEncoder
df['Country']= label_encoder.fit_transform(df['Country']) 
df.head()

   Country  Age  Salary
0        0   44   72000
1        2   34   65000
2        1   46   98000
3        2   35   45000
4        1   23   34000

In [148]:
from sklearn.preprocessing import OneHotEncoder
onehotencoder = OneHotEncoder()
X = onehotencoder.fit_transform(df.Country.values.reshape(-1,1)).toarray()
dfOneHot = pd.DataFrame(X, columns = ["Country_"+str(int(i)) for i in range(df.shape[1])]) 
df = pd.concat([df, dfOneHot], axis=1)
df=df.drop(['Country'], axis=1) 
df.head()

   Age  Salary  Country_0  Country_1  Country_2
0   44   72000        1.0        0.0        0.0
1   34   65000        0.0        0.0        1.0
2   46   98000        0.0        1.0        0.0
3   35   45000        0.0        0.0        1.0
4   23   34000        0.0        1.0        0.0

## Missing Values

In [149]:
dataset = pd.read_csv('data/pima-indians-diabetes1.csv', header=None)

In [150]:
dataset.head()

   0    1   2   3    4     5      6   7  8
0  6  148  72  35    0  33.6  0.627  50  1
1  1   85  66  29    0  26.6  0.351  31  0
2  8  183  64   0    0  23.3  0.672  32  1
3  1   89  66  23   94  28.1  0.167  21  0
4  0  137  40  35  168  43.1  2.288  33  1

In [151]:
dataset.describe()

                0           1           2  ...           6           7           8
count  768.000000  768.000000  768.000000  ...  768.000000  768.000000  768.000000
mean     3.845052  120.894531   69.105469  ...    0.471876   33.240885    0.348958
std      3.369578   31.972618   19.355807  ...    0.331329   11.760232    0.476951
min      0.000000    0.000000    0.000000  ...    0.078000   21.000000    0.000000
25%      1.000000   99.000000   62.000000  ...    0.243750   24.000000    0.000000
50%      3.000000  117.000000   72.000000  ...    0.372500   29.000000    0.000000
75%      6.000000  140.250000   80.000000  ...    0.626250   41.000000    1.000000
max     17.000000  199.000000  122.000000  ...    2.420000   81.000000    1.000000

[8 rows x 9 columns]

In [152]:
num_missing = (dataset[[1,2,3,4,5,7]] == 0).sum()

In [153]:
num_missing

1      5
2     35
3    227
4    374
5     11
7      0
dtype: int64

In [154]:
dataset[[1,2,3,4,5]] = dataset[[1,2,3,4,5]].replace(0, np.nan)
dataset.isnull().sum()

0      0
1      5
2     35
3    227
4    374
5     11
6      0
7      0
8      0
dtype: int64

In [155]:
dataset.head()

   0      1     2     3      4     5      6   7  8
0  6  148.0  72.0  35.0    NaN  33.6  0.627  50  1
1  1   85.0  66.0  29.0    NaN  26.6  0.351  31  0
2  8  183.0  64.0   NaN    NaN  23.3  0.672  32  1
3  1   89.0  66.0  23.0   94.0  28.1  0.167  21  0
4  0  137.0  40.0  35.0  168.0  43.1  2.288  33  1

### Remove rows

In [156]:
print(dataset.shape)
dataset.dropna(inplace=True)
print(dataset.shape)

(768, 9)
(392, 9)

### Replace missing value

Fill missing with mean

In [157]:
from sklearn.impute import SimpleImputer

In [158]:
dataset = pd.read_csv('data/pima-indians-diabetes.csv', header=None)
dataset[[1,2,3,4,5]] = dataset[[1,2,3,4,5]].replace(0, np.nan)
values = dataset.values
imputer = SimpleImputer(missing_values=np.nan, strategy='mean')
transformed_values = imputer.fit_transform(values)
print(f'Missing: {np.isnan(transformed_values).sum()}' )

Missing: 0

In [159]:
dataset.head()

   0      1     2     3      4     5      6   7  8
0  6  148.0  72.0  35.0    NaN  33.6  0.627  50  1
1  1   85.0  66.0  29.0    NaN  26.6  0.351  31  0
2  8  183.0  64.0   NaN    NaN  23.3  0.672  32  1
3  1   89.0  66.0  23.0   94.0  28.1  0.167  21  0
4  0  137.0  40.0  35.0  168.0  43.1  2.288  33  1

In [160]:
transformed_values[0]

array([  6.        , 148.        ,  72.        ,  35.        ,
       155.54822335,  33.6       ,   0.627     ,  50.        ,
         1.        ])

In [161]:
# Fill missing with most frequent value 

dataset = pd.read_csv('data/pima-indians-diabetes.csv', header=None)
dataset[[1,2,3,4,5]] = dataset[[1,2,3,4,5]].replace(0, np.nan)
values = dataset.values
imputer = SimpleImputer(missing_values=np.nan, strategy='most_frequent')
transformed_values = imputer.fit_transform(values)
print(f'Missing: {np.isnan(transformed_values).sum()}')

Missing: 0

In [162]:
transformed_values

array([[  6.   , 148.   ,  72.   , ...,   0.627,  50.   ,   1.   ],
       [  1.   ,  85.   ,  66.   , ...,   0.351,  31.   ,   0.   ],
       [  8.   , 183.   ,  64.   , ...,   0.672,  32.   ,   1.   ],
       ...,
       [  5.   , 121.   ,  72.   , ...,   0.245,  30.   ,   0.   ],
       [  1.   , 126.   ,  60.   , ...,   0.349,  47.   ,   1.   ],
       [  1.   ,  93.   ,  70.   , ...,   0.315,  23.   ,   0.   ]])

You can use other more complex heuristics

## Class Imbalance -  SMOTE

https://imbalanced-learn.readthedocs.io/en/stable/over_sampling.html

![image.png](attachment:image.png)

In [163]:
!pip install imblearn --user # in windows

Requirement already satisfied: imblearn in /usr/local/lib/python3.6/dist-packages (0.0)
Requirement already satisfied: imbalanced-learn in /usr/local/lib/python3.6/dist-packages (from imblearn) (0.4.3)
Requirement already satisfied: numpy>=1.8.2 in /usr/local/lib/python3.6/dist-packages (from imbalanced-learn->imblearn) (1.19.5)
Requirement already satisfied: scipy>=0.13.3 in /usr/local/lib/python3.6/dist-packages (from imbalanced-learn->imblearn) (1.4.1)
Requirement already satisfied: scikit-learn>=0.20 in /usr/local/lib/python3.6/dist-packages (from imbalanced-learn->imblearn) (0.22.2.post1)
Requirement already satisfied: joblib>=0.11 in /usr/local/lib/python3.6/dist-packages (from scikit-learn>=0.20->imbalanced-learn->imblearn) (1.0.0)

In [164]:
import imblearn
from collections import Counter
from sklearn.datasets import make_classification
from imblearn.over_sampling import SMOTE # doctest: +NORMALIZE_WHITESPACE

/usr/local/lib/python3.6/dist-packages/sklearn/externals/six.py:31: FutureWarning: The module is deprecated in version 0.21 and will be removed in version 0.23 since we've dropped support for Python 2.7. Please rely on the official version of six (https://pypi.org/project/six/).
  "(https://pypi.org/project/six/).", FutureWarning)
/usr/local/lib/python3.6/dist-packages/sklearn/utils/deprecation.py:144: FutureWarning: The sklearn.neighbors.base module is  deprecated in version 0.22 and will be removed in version 0.24. The corresponding classes / functions should instead be imported from sklearn.neighbors. Anything that cannot be imported from sklearn.neighbors is now part of the private API.
  warnings.warn(message, FutureWarning)

In [165]:
X, y = make_classification(n_classes=2, class_sep=2,
weights=[0.1, 0.9], n_informative=3, n_redundant=1, flip_y=0,
n_features=20, n_clusters_per_class=1, n_samples=1000, random_state=10)

In [166]:
print('Original dataset shape %s' % Counter(y))

Original dataset shape Counter({1: 900, 0: 100})

In [167]:
sm = SMOTE(random_state=42)

In [168]:
X_res, y_res = sm.fit_resample(X, y)

/usr/local/lib/python3.6/dist-packages/sklearn/utils/deprecation.py:87: FutureWarning: Function safe_indexing is deprecated; safe_indexing is deprecated in version 0.22 and will be removed in version 0.24.
  warnings.warn(msg, category=FutureWarning)

In [169]:
print('Resampled dataset shape %s' % Counter(y_res))

Resampled dataset shape Counter({0: 900, 1: 900})

Check out https://rikunert.com/SMOTE_explained for details